Tekla.Structures.Drawing.LeaderLinePlacingType
The LeaderLinePlacingType class defines a placing type that places the object with a leader line.

Tekla.Structures.Drawing.LeaderLinePlacingType.#ctor
Creates a new leader line placing type instance.